Revit 2027 API
BuiltInFailures.PerformanceFailures.TooManyAreaBoundaryLinesFound Property
 There are too many area boundary lines in area scheme <element> might result in increased model sizes on disk and in memory. Please investigate if area scheme is used in a proper way.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TooManyAreaBoundaryLinesFound { get; }
Public Shared ReadOnly Property TooManyAreaBoundaryLinesFound As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TooManyAreaBoundaryLinesFound {
	FailureDefinitionId^ get ();
}
static member TooManyAreaBoundaryLinesFound : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace